[
  {
    "company_name": "Satindra Metal & Graphics Pvt. Ltd.",
    "position": "Data Scientist",
    "time_served": "Jan, 2019 - July, 2020",
    "working_place": "Delhi, India",
    "points": [
      "Drove a 36% surge in data distribution pipelines using AWS Lambda, S3, and AutoCAD API, bolstering operational efficiency.",
      "Enhanced next-year revenue by 25% via innovative tech integration: AWS, Deep Learning, NLP in Flask-based REST API.",
      "Revolutionized data analysis with Report Clustering using TensorFlow's Doc2Vec, BERT, and LDA in SpaCy/NLTK for profound insights.",
      "Streamlined deployments with Docker and Kubernetes on ECS Cluster, ensuring scalable and high-performance operations."
    ]
  },
  
  {
    "company_name": "Tech Bae Pvt. Ltd.",
    "position": "Data Scientist",
    "time_served": "Jan, 2019 - July, 2020",
    "working_place": "Sydney, Australia",
    "points": [
      "Ideated and developed a new strategy to recommend Buyer's Choice items using Deep Learning in Automotive-search Platform Project.",
      "Led the technical architecture of NLP-based Chatbot and Car Recommendations which increased 28% User Engagement.",
      "Solved scalability problems by using r6g EC2-instances through Load Balancer, decreasing latency by 40% from 20sec to 5sec.",
      "Created Data Pipelines using AWS GLUE and S3 connected through Lambda with Airflow for Batch Processes.",
      "Deployed Data Management system on EKS using Docker and Kubernetes."
    ]
  },
  {
    "company_name": "Google Developers Student Club",
    "position": "Cloud Tech Lead",
    "time_served": "Oct 2019 - Mar 2020",
    "working_place": "Delhi, India",
    "points": [
      "Facilitated the Google Cloud Ready Program in the northern region of India, which successfully enrolled 250+ Students.",
      "As a lead organizer, I orchestrated monthly workshops and hackathons, fostering a community that grew by 50% in membership within a year."
    ]
  }
]
